// ДЗ 1
// Вам необхідно намалювати в консолі прямокутний трикутник із зірочок (або плюсиків, або якогось іншого символу): на першому рядку - одна зірочка, на другій дві, і так далі.
//  Рішення оформіть у вигляді функції, куди передаються два параметри: висота трикутника та символ, яким його потрібно "малювати".
// Якось так:
// drawTriangle(5, *);
// ﻿*
// **
// ***
// ****
// *****
// Умови виконання ДЗ
// Домашню роботу необхідно зробити двома способами
// В задачі не потрібно використовувати prompt або щось інше повязане з UI
// Не використовувати функції або інші матеріали які ми не вивчали
// Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки
// Будь ласка, надайте наступні дані для перевірки вашої роботи:
// Створіть гілку js_homework3.
// Додати туди ваше домашне завдання
// Вислати вашу гілку

// з чого складається цикл
// var j;
// for (var i = 11, j = "+"; i >= 0; j += "+") {
//     //var i = 11, j = "+";  - старт
//     //j = "+"; i >= 0; умова кінця
//     // j += "+" дія
//     console.log('+'+j);
//     i -= 1;


//  1 - ДЗ
// var height = 5;


for (let i = 1; i <= height; i++) {
    let row = '';
    for (let j = 1; j <= i; j++) {
        row += '* ';
    }
    console.log(row);
}







// ДЗ 2
// Вивести на екран суму чисел від 1 до 100 включно, які не кратні 3.
// Умови виконання ДЗ
// Не використовувати функції або інші матеріали які ми не вивчали
// Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки
// Будь ласка, надайте наступні дані для перевірки вашої роботи:
// Створіть гілку js_homework3.
// Додати туди ваше домашне завдання
// Вислати вашу гілку

// 2 - ДЗ 

// let total = 0;
// for (let i = 1; i <= 100; i++) {
//     if (i % 3 !== 0) {
//         total += i;
//     }
// }

// console.log( total);





// ДЗ 3:
// Написати функцію pow(x,y) яка буде приймати 2 цисла, перше це число яке ми будемо зводити у ступінь, друге у яку ступінь.
// Наприклад pow(2,3) функція поверне значення 8. 
// Умови виконання ДЗ
// Не використовувати **
// Не використовувати функції або інші матеріали які ми не вивчали
// Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки
// Будь ласка, надайте наступні дані для перевірки вашої роботи:


//  дз - 3


//   function pow(x, y) {
//     let res = 1;
//     for (let i = 0; i < y; i++) {
//         res *= x;
//     }
//     return res;
// }

// console.log(pow(2, 3)); // Виведе 8
