// ДЗ1
// Створіть об'єкт з щонайменше трьома властивостями (намагайтесь виявити фантазію). Напишіть метод getInfo(), який виводитиме всі властивості об'єкта у вигляді пар 
// "ключ: значення". Зверніть увагу: метод повинен працювати навіть після додавання нових властивостей до об'єкта. 
// Наприклад так:
// obj.getInfo(); // Правильна інформація про об'єкт
// obj.newProperty = 'Нова властивість!'; // Додали властивість до об'єкта
// obj.getInfo(); // Виводить всі властивості, включаючи щойно додану.
// Умови виконання ДЗ
// Не використовувати функції або інші матеріали які ми не вивчали
// Не використовувати методи keys, values, entries

const car = {
    brand: "ЗАЗ",
    model: "Lanos",
    year: 2024,
    getInfo: function() {
      for (let text in this) {
        if (typeof this[text] !== "function") {
          console.log(`${text}: ${this[text]}`);
        }
      }
    }
  };
  
  car.getInfo();
  
  
  
  

// ДЗ2 Сума вартості послуг
//  Припустимо, у нас є об'єкт. Властивості об'єкта - назва послуги та її вартість:
// var services = {
// 	"стрижка": "60 грн",
// 	"гоління": "80 грн",
// 	"Миття голови": "100 грн"
// };
// "Послуги" можуть додаватися по ходу роботи:
// services['Розбити скло'] = "200 грн";
// Умови виконання ДЗ
// створити метод price(), який обчислює та повертає загальну вартість "наданих послуг".
// створити метод minPrice() - який повертає мінімальний price
// створити метод maxPrice() - який повертає максимальний price

