// HomeWork4
/*Необхідно написати програму яка буде виводити інформацію за умовами при яких число виводитиметься з правильним словом:
"рік", "роки" або "років". Тобто. "29 років" чи "4 роки".

Умови виконання ДЗ

Рік отримувати через prompt()
Зробити перевірку що користувачь ввів число та це число не є відємним
Не використовувати функції або інші матеріали які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки.
Будь ласка, надайте наступні дані для перевірки вашої роботи:

Створіть гілку js_homework2.
Додати туди ваше домашне завдання
Вислати вашу гілку*/