// ДЗ 1

// Написати свою реалізацію функції isNaN. 

// Умови виконання ДЗ

// Не використовувати функції або інші матеріали які ми не вивчали
// Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки
// Не викорисутовувати isNaN/ Number.isNaN
// Будь ласка, надайте наступні дані для перевірки вашої роботи:

// Створіть гілку js_homework4.
// Додати туди ваше домашне завдання
// Вислати вашу гілку


// Метод isNaN (is Not-a-Number) в JavaScript використовується для перевірки, чи є передане значення нечисловим (NaN) типом.
// Цей метод повертає true, якщо значення є NaN, і false, якщо значення може бути конвертовано в число.







// ДЗ 2

// Необхідно написати власну реалізацію функцій padEnd та padStart, але у вас повинна бути одна функція pad(‘qwerty’, ‘+’, true), яка приймає чотири аргументи:

// рядок, до якого буде додаватися символ.
// символ, який буде додаватися.
// Скільки додавати символів
// булеве значення, яке вказує, куди додавати символ. Якщо true, то до початку, якщо false, то в кінець.
// Останній аргумент повинен працювати як і в оригінальній функції, а саме якщо наш рядок з 5 символів, а ви вказуєте знаачення 6, то додаєте тільки один символ
// Умови виконання ДЗ

// Функція повина повертати новий рядок
// Не використовувати функції або інші матеріали які ми не вивчали
// Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки
// Будь ласка, надайте наступні дані для перевірки вашої роботи:

// Створіть гілку js_homework4.
// Додати туди ваше домашне завдання
// Вислати вашу гілку
// ﻿ДЗ3

// Перевірка теорії ймовірності. Напишіть функцію яка буде генерувати певну кількість випадкових чисел в діапазоні від 100 до 1000 включно. Порахувати кількість парних та непарних серед них. Обчислити відсоткове співвідношення - чи буде воно близьке до 50%50? Приклад функції checkProbabilityTheory(count). Парметр count буде вказувати скільки разів буде генеруватися випадкове число.

// Умови виконання ДЗ

// Функція виводить інформацію
// Кількість згенерованих чисел: кількість чисел
// Парних чисел: кількість парних чисел
// Не парних чисел: кількість не парних чисел
// Відсоток парних до не парних: 
// Не використовувати функції або інші матеріали які ми не вивчали
// Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки
// Будь ласка, надайте наступні дані для перевірки вашої роботи:

// Створіть гілку js_homework4.
// Додати туди ваше домашне завдання


